# -*- coding: utf-8 -*-
ALL_UA_CITIES = sorted({
    "Київ",
    "Львів",
    "Одеса",
    "Харків",
    "Дніпро",
    "Запоріжжя",
    "Вінниця",
    "Івано-Франківськ",
    "Тернопіль",
    "Чернівці",
    "Ужгород",
    "Луцьк",
    "Рівне",
    "Житомир",
    "Хмельницький",
    "Черкаси",
    "Кропивницький",
    "Полтава",
    "Суми",
    "Чернігів",
    "Миколаїв",
    "Херсон",
    "Сімферополь"
})


def city_list(request):
    """Передає повний список міст України без повторень."""
    selected_city = request.session.get('selected_city', '')
    return {
        'available_cities': ALL_UA_CITIES,
        'selected_city': selected_city,
    }
